# データの仕上げと準備

In [10]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [3]:
data=pd.Series([1,NA,3.5,NA,7])
data.dropna()#data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                  [NA,NA,NA],[NA,6.5,3.]])
cleaned=data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [7]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [8]:
data[4]=NA
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  2.252256       NaN       NaN
1  0.893548       NaN       NaN
2  0.360628       NaN  1.182216
3 -1.326965       NaN  0.710496
4  0.317107 -0.814342  0.685409
5  0.239108 -0.755754 -2.415259
6 -0.649714 -0.175529  1.790925

In [12]:
df.dropna(thresh=2)

          0         1         2
2  0.360628       NaN  1.182216
3 -1.326965       NaN  0.710496
4  0.317107 -0.814342  0.685409
5  0.239108 -0.755754 -2.415259
6 -0.649714 -0.175529  1.790925

# 欠損データを記入

In [13]:
df.fillna(0)

          0         1         2
0  2.252256  0.000000  0.000000
1  0.893548  0.000000  0.000000
2  0.360628  0.000000  1.182216
3 -1.326965  0.000000  0.710496
4  0.317107 -0.814342  0.685409
5  0.239108 -0.755754 -2.415259
6 -0.649714 -0.175529  1.790925

In [14]:
df.fillna({1:0.5,2:0})

          0         1         2
0  2.252256  0.500000  0.000000
1  0.893548  0.500000  0.000000
2  0.360628  0.500000  1.182216
3 -1.326965  0.500000  0.710496
4  0.317107 -0.814342  0.685409
5  0.239108 -0.755754 -2.415259
6 -0.649714 -0.175529  1.790925

In [19]:
_=df.fillna(0,inplace=True)
df

          0         1         2
0  2.252256  0.000000  0.000000
1  0.893548  0.000000  0.000000
2  0.360628  0.000000  1.182216
3 -1.326965  0.000000  0.710496
4  0.317107 -0.814342  0.685409
5  0.239108 -0.755754 -2.415259
6 -0.649714 -0.175529  1.790925

In [20]:
df=pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0  0.406315  0.253830 -0.457202
1 -0.545890 -2.117718  0.654292
2 -0.980454       NaN  1.081517
3  0.803720       NaN -0.855415
4 -0.502746       NaN       NaN
5  0.103253       NaN       NaN

In [21]:
df.fillna(method='ffill')

          0         1         2
0  0.406315  0.253830 -0.457202
1 -0.545890 -2.117718  0.654292
2 -0.980454 -2.117718  1.081517
3  0.803720 -2.117718 -0.855415
4 -0.502746 -2.117718 -0.855415
5  0.103253 -2.117718 -0.855415

In [22]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.406315  0.253830 -0.457202
1 -0.545890 -2.117718  0.654292
2 -0.980454 -2.117718  1.081517
3  0.803720 -2.117718 -0.855415
4 -0.502746       NaN -0.855415
5  0.103253       NaN -0.855415

In [23]:
data=pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# データの転換

In [24]:
data= pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [26]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [27]:
data['v1']=range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [28]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# 関数マッピングを用いてデータを変換する

In [31]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon',
                          'pastrami','corned beef','bacon',
                          'pastrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3.,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal={'bacon':'pig',
               'pulled pork':'pig',
               'pastrami':'cow',
               'corned beef':'cow',
               'honey ham':'pig',
               'nova lox':'salmon'}
lowercased= data['food'].str.lower()
lowercased#頭文字を小文字に変換する

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [35]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [36]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [39]:
data=pd.Series([1.,-999.,2,-999,-1000,3])
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [45]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                  index=['ohio','colorado','New York'],
                  columns=['one','two','three','four'])
transform=lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [48]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [49]:
data.rename(index={'ohio':'indiana'},
           columns={'three':'peekaboo'})

      one  two  peekaboo  four
OHIO    0    1         2     3
COLO    4    5         6     7
NEW     8    9        10    11

In [50]:
data.rename(index={'ohio':'indiana'},
           columns={'three':'peekaboo'},inplace= True)
data

      one  two  peekaboo  four
OHIO    0    1         2     3
COLO    4    5         6     7
NEW     8    9        10    11

In [54]:
ages=[20,22,18,25,27,21,23,37,31,61,45,64,5,2]
bins =[18,25,35,60,100]
cats=pd.cut(ages,bins)
cats

[(18.0, 25.0], (18.0, 25.0], NaN, (18.0, 25.0], (25.0, 35.0], ..., (60.0, 100.0], (35.0, 60.0], (60.0, 100.0], NaN, NaN]
Length: 14
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [55]:
cats.codes

array([ 0,  0, -1,  0,  1,  0,  0,  2,  1,  3,  2,  3, -1, -1], dtype=int8)

In [56]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [57]:
pd.value_counts(cats)

(18, 25]     5
(60, 100]    2
(35, 60]     2
(25, 35]     2
dtype: int64

In [58]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [18, 26), [26, 36), ..., [61.0, 100.0), [36.0, 61.0), [61.0, 100.0), NaN, NaN]
Length: 14
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [59]:
group_names=['youth','youngadult','middleaged','senior']
pd.cut(ages,bins,labels=group_names)

[youth, youth, NaN, youth, youngadult, ..., senior, middleaged, senior, NaN, NaN]
Length: 14
Categories (4, object): [youth < youngadult < middleaged < senior]

In [80]:
data=np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.0074, 0.25], (0.0074, 0.25], (0.5, 0.75], (0.25, 0.5], (0.0074, 0.25], ..., (0.25, 0.5], (0.0074, 0.25], (0.75, 0.99], (0.25, 0.5], (0.0074, 0.25]]
Length: 20
Categories (4, interval[float64]): [(0.0074, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

In [66]:
data=np.random.randn(1000)
cats=pd.qcut(data,4,precision=2)
cats

[(-0.045, 0.67], (-0.045, 0.67], (-0.7, -0.045], (-0.7, -0.045], (-0.045, 0.67], ..., (-0.7, -0.045], (-2.67, -0.7], (-0.045, 0.67], (-0.7, -0.045], (0.67, 3.05]]
Length: 1000
Categories (4, interval[float64]): [(-2.67, -0.7] < (-0.7, -0.045] < (-0.045, 0.67] < (0.67, 3.05]]

In [77]:
pd.value_counts(cats)

(0.67, 3.05]      250
(-0.045, 0.67]    250
(-0.7, -0.045]    250
(-2.67, -0.7]     250
dtype: int64

In [83]:
cats=pd.qcut(data,[0,0.1,0.5,0.9,1.])
pd.value_counts(cats)

(0.399, 0.779]      8
(0.068, 0.399]      8
(0.779, 0.994]      2
(0.00743, 0.068]    2
dtype: int64

In [84]:
data=pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.035358     0.073351     0.018411    -0.017772
std       1.014335     1.011413     0.992180     0.997039
min      -2.957689    -2.776649    -3.470509    -3.134084
25%      -0.675114    -0.630714    -0.650938    -0.683538
50%       0.054735     0.094370     0.044307     0.018518
75%       0.727605     0.783921     0.690442     0.672750
max       3.280413     2.928727     3.706423     3.079641

In [85]:
col=data[2]
col[np.abs(col)>3]

610   -3.470509
960    3.706423
Name: 2, dtype: float64

In [87]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
289  1.053773  0.169864 -0.763524 -3.134084
588  3.029579 -0.796448  1.674101  0.092957
610 -0.254808 -0.269274 -3.470509 -0.542003
837  3.280413  1.481665  0.370596  0.044331
886 -0.436401 -1.668414  0.613151  3.079641
960  0.304354  0.564174  3.706423  0.904075

In [88]:
data[np.abs(data)>3]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.035048     0.073351     0.018175    -0.017718
std       1.013388     1.011413     0.988251     0.996383
min      -2.957689    -2.776649    -3.000000    -3.000000
25%      -0.675114    -0.630714    -0.650938    -0.683538
50%       0.054735     0.094370     0.044307     0.018518
75%       0.727605     0.783921     0.690442     0.672750
max       3.000000     2.928727     3.000000     3.000000

In [89]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0 -1.0  1.0  1.0

In [90]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler=np.random.permutation(5)
sampler

array([1, 3, 4, 2, 0])

In [91]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [92]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [93]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [96]:
choice=pd.Series([5,7,-1,1,6])
draws=choice.sample(n=10,replace=True)
draws

4    6
3    1
2   -1
2   -1
2   -1
3    1
2   -1
2   -1
3    1
1    7
dtype: int64

In [98]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],'detal':range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [100]:
dummies=pd.get_dummies(df['key'],prefix='key')
df_with_dummy=df[['detal']].join(dummies)
df_with_dummy

   detal  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

# 文字列の操作

In [101]:
val='a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [104]:
pieces=[x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [105]:
first, second ,third=pieces
first+'::'+second+'::'+third

'a::b::guido'

In [106]:
'::'.join(pieces)

'a::b::guido'

In [107]:
'guido' in val

True

In [108]:
val.index(',')

1

In [109]:
val.find(':')#indexはいない場合でエラーを返事する

-1

In [110]:
val.count(',')

2

In [111]:
val.replace(',','::')

'a::b:: guido'

# 正規表現

In [112]:
import re
text='foo   bar\t baz  \tqux'
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [113]:
regex=re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [114]:
regex.findall(text)

['   ', '\t ', '  \t']

In [117]:
text="""Dave dave@google.com
        Steve steve@gmail.com
        Rob rob@gmial.com
        Ryan ryan@yahoo.com"""
pattern=r'[A-Z0-9._%+1]+@[A-Z0-9,-]+\.[A-Z]{2,4}'
regex=re.compile(pattern,flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmial.com', 'ryan@yahoo.com']

In [118]:
m=regex.search(text)
m

In [119]:
text[m.start():m.end()]

'dave@google.com'

In [120]:
print(regex.match(text))

None

In [121]:
print(regex.sub('REDACTED',text))

Dave REDACTED
        Steve REDACTED
        Rob REDACTED
        Ryan REDACTED

In [123]:
pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9,-]+)\.([A-Z]{2,4})'
regex= re.compile(pattern,flags=re.IGNORECASE)
m=regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [124]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmial', 'com'),
 ('ryan', 'yahoo', 'com')]

In [125]:
print(regex.sub(r'Username:\1,Domain:\2,Suffix:\3',text))

Dave Username:dave,Domain:google,Suffix:com
        Steve Username:steve,Domain:gmail,Suffix:com
        Rob Username:rob,Domain:gmial,Suffix:com
        Ryan Username:ryan,Domain:yahoo,Suffix:com

In [127]:
data={'Dave': 'dave@google.com',
        'Steve': 'steve@gmail.com',
        'Rob':' rob@gmial.com',
        'Ryan': 'ryan@yahoo.com',
     'wes':np.nan}
data=pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmial.com
Ryan      ryan@yahoo.com
wes                  NaN
dtype: object

In [128]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob      False
Ryan     False
wes        NaN
dtype: object

In [129]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9,-]+)\\.([A-Z]{2,4})'

In [130]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmial, com)]
Ryan      [(ryan, yahoo, com)]
wes                        NaN
dtype: object

In [131]:
matches=data.str.match(pattern,flags=re.IGNORECASE)
matches

Dave      True
Steve     True
Rob      False
Ryan      True
wes        NaN
dtype: object

In [132]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Ryan    NaN
wes     NaN
dtype: float64

In [133]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Ryan    NaN
wes     NaN
dtype: float64

In [134]:
data.str[:5]

Dave     dave@
Steve    steve
Rob       rob@
Ryan     ryan@
wes        NaN
dtype: object